//21:48 ~
//최소 이동거리(시작, 끝 포함)
//ex) 13 -> 3개, 58 -> 5개.

#include <stdio.h>
int main() {
    int n;
    int cnt = 6;            //
    int distance = 1;           //몇개의 방?
    int num_cnt = 0;
    
    scanf("%d", &n);        //13입력
    
        for(int j=0; j<cnt; j++) {
            num_cnt++;
            
            if(j%6 == 0) {
                cnt += 6;
                distance++;
            }
            if(n == num_cnt) {
                printf("%d", distance);
            }
        }
    
    
}
//변환점 1 -> 1개 / 2,3,4,5,6,7 -> 2개 / 8~19 -> 3개


//2거리 - 2 ~ 7           6       (한칸씩 더 거리가 추가될수록 끝-시작 값의 범위 횟수가 6씩 커짐)
//3거리 - 8 ~ 19          12
//4거리 - 20 ~ 37         18
//5거리 - 38 ~ 61         24
//6거리 - 62 ~             30

//2개 - 2,3,4,5,6,7
//3개 - 8,9,10,11,12,13,14,15,16,17,18,19
//4개 - 20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37
